const texts = {

    "01": `بدون حرکت بایست، اما نگاهت را مدام جابه‌جا کن.`,

    "02": `یک مکعب را انتخاب کن و چهار بار از آن دور شو و برگرد.`,

    "03": `قبل از حرکت، جهت حرکتت را با صدای بلند اعلام کن. سپس خلاف آن جهت حرکت کن.`,

    "04": `به اولین کسی که رسیدی برای مدت طولانی با او چشم در چشم شو و اگر فرد مقابل از تماس چشمی امتناع کرد، او را تا مدتی دنبال کن.`,

    "05": `یک نفر را پیدا کن و برای مدتی هر حرکتی را که انجام می‌دهد از او تقلید کن!`,

    "06": `شماره 7 را اسکن کن`,

    "07": `شماره 11 را اسکن کن`,

    "08": `شماره 78 را اسکن کن`,

    "09": `یک موزیک خیلی قری با موبایلت پلی کن. اگر توی موبایلت موزیکی نداری، توی اینترنت سرچ کن موزیک قری و اولین نتیجه را پلی کن!`,

    "10": `اگر هر نوع مزاحمتی از سمت کسی احساس کردی، از او بخواه شماره 20 را اسکن کند.`,

    "11": `برای چهار دقیقه بدون هیچ حرکت و صدایی در یک نقطه از این فضا قرار بگیر.`,

    "12": `تصور کن که مفصل مچ دست چپت سر یک قلموی نقاشی‌ست. با آن بزرگ‌ترین منحنی ممکن را در این فضا رسم کن.`,

    "13": `بر خلاف جهت رفت و آمد عموم حرکت کن.`,

    "14": `در مرکز فضا بایست و برای مدتی مسیر افراد را مختل کن.`,

    "15": `این دستور فقط در صورتی قابل اجراست که دستور قبلی را درست و دقیق انجام داده باشی، اگر آن را انجام ندادی دوباره امتحان کن! در غیر این‌صورت، مکعب را دوبار بچرخان و آن روی زمین قرار بده.`,

    "16": `در فضا راه بروید و ناگهان تغییر جهت بدهید! برای مدتی این کار را ادامه دهید!`,

    "17": `یک صدا تولید کنید!
صدایی به قصد ایجاد مزاحمت برای دیگران.`,

    "18": `یک نقطه را انتخاب کنید و به مدت ده دقیقه همان‌جا بمانید. اگر خسته شدید، در جا بالا و پایین بپرید!`,

    "19": `یک سوال خیلی خصوصی از کسی بپرسید.`,

    "20": `برای 4 دقیقه سکوت کنید! و اگر خواستید، دیگران را نیز به سکوت دعوت کنید.`,

    "21": `یک دیوار را انتخاب کنید، به آن تکیه بدهید و به نقاط تماس بدنتان با دیوار توجه کنید. تا هر وقت که می‌خواهید در همین وضعیت بمانید.`,

    "22": `روی زمین بنشینید، چشمانتان را ببندید و منتظر بمانید تا یک عامل بیرونی شما را از این وضعیت خارج کند.`,

    "23": `اولین شعر یا ترانه‌ای که به ذهنتان می‌رسد را با صدای بلند بخوانید.`,

    "24": `اگر کسی شروع به آواز خواندن کرد با اون همراه شوید و اگر شعر آن آواز را بلد نیستید فقط ریتم آن را زمزه کنید. در غیر این‌صورت خودتان آواز بخوانید.`,

    "25": `سه بار از این فضا خارج شو و دوباره وارد شو! هربار که وارد شدی، با موبایلت یک عکس از فضا بگیر.`,

    "26": `به استخوان ترقوه راستت توجه کن! آن را با دست لمس کن، به آن نگاه کن و خیلی آهسته آن استخوان را حرکت بده.`,

    "27": `دست چپت را ده بار بالا بیار و پایین ببر.`,

    "28": `28 بار درجا بالا و پایین بپر`,

    "29": `در فضا راه برو و مراقب باش همواره حداقل یک متر با افراد دیگر فاصله داشته باشی.`,

    "30": `یک نفر را انتخاب کن و برایش یک جوک تعریف کن!`,

    "31": `با سرعت زیاد به سمت دورترین فرد حرکت کن!`,

    "32": `هر وقت کسی ایستاد، تو شروع به حرکت کن!`,

    "33": `یک دقیقه بایست و هیچ کاری نکن!`,

    "34": `هر سی ثانیه یک بار سرعت حرکتت را تغییر بده! (از خیلی خیلی خیلی آهسته به خیلی خیلی خیلی سریع)`,

    "35": `فقط در مسیرهایی حرکت کن که قبلاً کسی از آن‌ها عبور کرده.`,

    "36": `هر بار کسی از کنارت رد شد، خم شو و پاهایت را با دستانت بغل کن. برای ده دقیقه این کار اجرا کن!`,

    "37": `روبروی یک نفر بایست و سه بار بگو: اینجا چی کار می‌کنی؟`,

    "38": `هر بار که دست کسی بالا رفت، دستت را پایین بیاور و برعکس.`,

    "39": `یک آینه جیبی از کسی قرض بگیر و آن را مقابل صورت افراد بگیر و برای مدتی این کار را ادامه بده.`,

    "40": `پای راستت را ده بار به زمین بکوب.`,

    "41": `به هر طریقی که می‌توانی نظم جمعی را مختل کن.`,

    "42": `به هر طریقی که می‌توانی یک نظم جمعی ایجاد کن! (می‌توانی از همه بخواهی یک کار مشخص را انجام دهند یا یک هارمونی جمعی بسازی)`,

    "43": `به هر شکلی که می‌توانی یک تیم تشکیل بده و با آن‌ها هدف مشترکی بساز! (حداقل 4 نفر)`,

    "44": `یک دیوار را در آغوش بکش.`,

    "45": `یک موضوع خیلی خصوصی را با کسی درمیان بگذارید.`,

    "46": `تا هر زمانی که می‌خواهید به یکی از افراد حاضر در این جمع خیره شوید.`,

    "47": `لباس‌هایت را از تنت دربیاور و اگر دوست نداری این کار را کنی شماره 48 را اسکن کن!`,

    "48": `لحظه دریافت دستور قبلی را به یاد بیاور و فکر کن به اینکه در آن لحظه چه حسی در تو ایجاد شد؟`,

    "49": `چشمانت را ببند و روی زمین بنشین. برای مدتی در همین وضعیت بمان و فقط به صداها گوش کن.`,

    "50": `مکعب را جا به جا کن.`,

    "51": `با صدای بلند بخند. جوری که توجه دیگران را جلب کنی.`,

    "52": `برقص و اگر دوست نداری برقصی شماره 15 را اسکن کن.`,

    "53": `مکعب را روی سرت قرار بده و چهار قدم بردار. اگر مکعب از روی سرت افتاد.
شماره 11 را اسکن کن.

در غیر این‌صورت یک نفر را انتخاب کن و مکعب را به او بده.`,

    "54": `هر کسی که از کنارت عبور کرد، تغییر جهت ناگهانی بده.`,

    "55": `به مرکز فضا برو. دو دور کامل بچرخ. از مرکز خارج شو.`,

    "56": `با سرعت بسیار بسیار آهسته در فضا راه برو. (هر قدمی که برمی‌داری، از لحظه برداشتن پا از زمین تا لحظه انتقال وزن و بازگشت پا به زمین باید تا سی ثانیه طول بکشد) حداقل 4 قدم بردار.`,

    "57": `یک دقیقه فقط به راست حرکت کن! سپس یک دقیقه فقط به چپ حرکت کن!`,

    "58": `هر بار که کسی ایستاد، دستت را بالا ببر.`,

    "59": `یک حرکت را انتخاب و آن را ۲۰ بار تکرار کن
(مثلا دست راستت را در هوا بچرخان).`,

    "60": `یک نفر را انتخاب کن. در مقابل او بایست و مانع حرکتش شو.`,

    "61": `به مدت سه دقیقه فقط به عقب حرکت کن.`,

    "62": `به نزدیک‌ترین گوشه فضا برو. چهل ثانیه آنجا بمان.`,

    "63": `از یک دیوار تا دیوار روبرو راه برو، اما در مسیری غیرمستقیم حرکت کن.`,

    "64": `جای 4 مکعب را با هم عوض کن.`,

    "65": `منتظر بمان و اولین نفری که روی زمین نشست را پیدا کن. ده ثانیه بعد تو هم بنشین.`,

    "66": `آخرین حرکتی را که از کسی دیدی، سه بار تکرار کن.`,

    "67": `یک نفر را انتخاب کن و حرکاتش را تقلید کن، اما با یک تأخیر پنج ثانیه‌ای.`,

    "68": `سه بار حرکت فردی را تکرار کن؛ بار چهارم حرکتی کاملاً متفاوت انجام بده.`,

    "69": `فقط با یک پا حرکت کن.`,

    "70": `فقط به شکل منحنی و یا در خطوط منحنی حرکت کن.`,

    "71": `هرگاه دو نفر به هم نزدیک شدند، بین آن‌ها قرار بگیر`,

    "72": `تعداد افراد ایستاده را بشمار. همان تعداد قدم بردار.`,

    "73": `سعی کن یک نفر را وادار کنی جای خودش را تغییر دهد، بدون تماس و بدون صحبت.`,

    "74": `هیچ کاری نکن!`,

    "75": `شماره 13 را اسکن کن.`,

    "76": `شماره 17 را اسکن کن.`,

    "77": `شماره 27 را اسکن کن.`,

    "78": `شماره 39 را اسکن کن.`,

    "79": `شماره 12 را اسکن کن.`,

    "80": `مکعب را میان دستانت بگیر و آن را برای مدتی روبروی صورتت نگه دار.`,

    "81": `مکعب را کف دست راستت قرار بده و سه دقیقه در همین وضعیت بمان.`,

    "82": `مکعب را به شکمت بچسبان و چهل ثانیه در همین وضعیت بمان.`,

    "83": `با دست چپ مکعب را روی سرت قرار بده و برای یک دقیقه در همین وضعیت بمان.`,

    "84": `دور این مکعب به شکل دایره راه برو. هفت بار این حرکت را تکرار کن!`,

    "85": `هفت مکعب را انتخاب کن و با قدم‌هایت آن‌ها را به هم وصل کن. به مکعب هفتم که رسیدی، مسیر طی شده را تا مکعب اول برگرد.`,

    "86": `بین دو مکعب بایست و هرکسی خواست آن‌ها را اسکن کند، اجازه نده و مانع شو!`,

    "87": `از یک مکعب به مکعبی دیگر برو و تا سه بار تکرار کن! هربار مسیری متفاوت را طی کن!`,

    "88": ``,

    "89": `یک مکعب را انتخاب کن و آن را در نقطه‌ای از فضا قرار بده که فکر می‌کنی نباید آنجا باشد.`,

    "90": `از این لحظه به بعد هیچ کیوآرکدی را اسکن نکن و فقط حرکت دیگران را مشاهده کن!`,

    "91": `با کسی تماس تلفنی بگیر و یک مکالمه خیلی خصوصی را با او در همین فضا انجام بده.`,

    "92": `اگر دیدی کسی قصد دارد به حریم تو و یا دیگران وارد ‌شود، به هر طریقی که می‌خواهی مانع او شو!`,

    "93": `یک نفر را انتخاب کن و تا وقتی در این فضا هستی، به او لبخند بزن.`,

    "94": `ده مکعب را به شکلی متراکم در فضا قرار بده جوری که بین‌ آن‌ها فضای خالی وجود نداشته باشد.`,

    "95": `مکعب‌ها را به شکل پراکنده در فضا پخش کن! جوری که در فاصله برابری از هم قرار بگیرند.`,

    "96": `این مکعب را به شکلی روی زمین قرار بده که دیگر یک مکعب نباشد.`,

    "97": `اولین کیوآرکدی را که اسکن کردی به یاد بیاور. دوباره به آن برگرد و بار دیگر انجامش بده.`,

    "98": `در فضا راه برو و با هر کسی چشم در چشم شدی، به او بگو: خداحافظ!`,

    "99": `سه نفر را انتخاب کن و بدون اینکه با آن‌ها تماس بدنی داشته باشی، در نزدیک‌ترین وضعیت به بدنشان قرار بگیر.`,

    "100": `یک نفر را انتخاب کن و چهار بار با فاصله زمانی مشخص نامش را از او بپرس!`,

    "101": `یک نفر را انتخاب کن و با او دست بده، اگر او موافقت کرد و دست داد، برای سی ثانیه دستش را نگه دار و رها نکن!`,

    "102": `به یک نفر سیگار تعارف کن و اگر نداری، از کسی سیگار درخواست کن.`,

    "103": `به هر شکلی که می‌توانی بدنت را به یک مکعب مربع تبدیل کن.`

};


// گرفتن شماره تسک از URL
const urlParams = new URLSearchParams(window.location.search);
const textID = urlParams.get("text");

// پیدا کردن المان نمایش تسک
const taskElement = document.getElementById("task");

// بررسی وجود المان
if (!taskElement) {
    console.error("Element with id='task' was not found.");

} else if (textID && Object.hasOwn(texts, textID)) {

    // اگر شماره تسک وجود داشته باشد، متن تسک نمایش داده شود
    taskElement.textContent = texts[textID];

} else {

    // اگر شماره تسک وجود نداشته باشد، عکس نمایش داده شود
    taskElement.innerHTML = `
        <img src="text.jpg" alt="" class="fixed-background">
    `;
}